#+TITLE: 
#+AUTHOR: 
#+EMAIL: 
#+DATE: 2026-03-01T17:25:50Z UTC 
#+LANGUAGE:  en 
#+EXPORT_FILE_NAME: HaskellInDepth1.html
# --- Configurations ---
#+SETUPFILE: /home/galaxybeing/Dropbox/org/tufte-html-setup.org
#+SETUPFILE: /home/galaxybeing/Dropbox/org/math-latex-setup.org
# --- Configurations ---
#+SETUPFILE: /home/galaxybeing/Dropbox/org/tufte-html-setup.org
#+SETUPFILE: /home/galaxybeing/Dropbox/org/math-latex-setup.org
# --- Bibliography ---
#+bibliography: /home/galaxybeing/Dropbox/org/biblio/ref.bib
#+cite_export: csl
# --- Document Content Starts Here ---
#+INCLUDE: /home/galaxybeing/Dropbox/org/codeismathiscode2/header.org :minlevel 1



* HID 1

** Bibliography :noexport:
:PROPERTIES:
:header-args: :dir "/home/galaxybeing/Dropbox/org/omnimath"
:END:
:RESOURCES:
- [[bibliography:~/Dropbox/org/biblio/ref.bib][Bibliography]]
- [[cite:&doets2012haskell]]
:END:

** Not exported :noexport:

#+name: hid1
#+begin_src haskell :eval never :exports code :tangle ./src/hid1.hs :noweb yes
module HID1 where


<<b6704bd1-e127-407b-965f-310eef24d63e>>

#+end_src

#+name: 6b14996d-7528-4c2a-a081-ccd244799b49
#+begin_src haskell :results verbatim :exports both
1 + 1
#+end_src


* 

** Manipulating a radar antenna with type classes

#+name: b6704bd1-e127-407b-965f-310eef24d63e
#+begin_src haskell :eval never :exports code
data Direction = North | East | South | West
  deriving (Eq, Enum, Bounded, Show)
data Turn = TNone | TLeft | TRight | TAround
  deriving (Eq, Enum, Bounded, Show)
#+end_src

#+name: 29960dc2-072f-409c-bdb2-d2f1f976da2e
#+begin_src haskell :results verbatim :exports both
:i succ
#+end_src

#+RESULTS: 29960dc2-072f-409c-bdb2-d2f1f976da2e
: type Enum :: * -> Constraint
: class Enum a where
:   succ :: a -> a
:   ...
:   	-- Defined in ‘GHC.Enum’

#+name: ad8c198c-752a-4b55-a87b-229509ca00a1
#+begin_src haskell :results verbatim :exports both
succ North
#+end_src

#+RESULTS: ad8c198c-752a-4b55-a87b-229509ca00a1
: East






#+INCLUDE: "./footer.org" :minlevel 1

* Footnotes

